app/controllers/admin/accounts_controller.rb

     def index
    @accounts = Account.all
---
SELECT * FROM `accounts`

     def destroy
        @account = Account.find(params[:id])
        @account.destroy
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 2)
DELETE FROM `accounts` WHERE `id` = 2

     def edit
       @account=Account.find(params[:id])
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)

     def update
       @account=Account.find(params[:id])
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)

     def show
       @account=Account.find(params[:id])
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)

     def change_password
       @account=Account.find(params[:id])
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)

     def update_password
       @account=Account.find(params[:id])
       respond_to do |format|
       if params[:new_password]==params[:confirmation_new_password]
       sha_password=Account.encrypted_pwd(params[:new_password])
       @account.pwd=sha_password
          if @account.save
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
UPDATE `accounts` SET `updated_at` = '2010-05-10 16:18:36', `pwd` = '17ba0791499db908433b80f37c5fbc89b870084b' WHERE `id` = 1