app/controllers/accounts_controller.rb

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
---
  def show
    @account = Account.find(params[:id])

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
---
  def edit
    @account = Account.find(params[:id])

INSERT INTO `accounts` (`name`, `created_at`, `updated_at`, `group_id`, `pwd`, `email`) VALUES('adsf', '2010-04-24 06:08:48', '2010-04-24 06:08:48', NULL, '17ba0791499db908433b80f37c5fbc89b870084b', 'asd')
---
  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
---
  def update
    @account = Account.find(params[:id])

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
DELETE FROM `accounts` WHERE `id` = 1
---
  def destroy
    @account = Account.find(params[:id])
    @account.destroy

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
---
   def change_password
       @account=Account.find(params[:id])

SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
---
     def update_password
       @account=Account.find(params[:id])