app/controllers/chapters_controller.rb

SELECT * FROM `novels` WHERE (`novels`.`id` = 1)
---
  def index
    @novel= Novel.find(params[:novel_id])