app/controllers/novels_controller.rb

  def index
    @category=Category.find(params[:category_id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 2)

  def show
    @novel = Novel.find(params[:id])
---
SELECT * FROM `novels` WHERE (`novels`.`id` = 1)

  def edit
    @novel = Novel.find(params[:id])
---
SELECT * FROM `novels` WHERE (`novels`.`id` = 1)

  def create
    @novel = Novel.new(params[:novel])
    upload
    respond_to do |format|
      if @novel.save
---
INSERT INTO `novels` (`name`, `writer`, `created_at`, `updated_at`, `url`, `click_count`, `download_count`, `category_id`) VALUES('凤城飞帅', '小肥', '2010-04-23 14:54:26', '2010-04-23 14:54:26', '--- !ruby/object:File \ncontent_type: text/plain\noriginal_path: !binary |\n 5Yek5Z+O6aOe5biFLnR4dA==\n\n', NULL, NULL, 1)

  def update
    @novel = Novel.find(params[:id])
---
SELECT * FROM `novels` WHERE (`novels`.`id` = 1)

   def read
      @novel= Novel.find(params[:id])
      @novel.click_count=@novel.click_count+1
      @novel.save
---
SELECT * FROM `novels` WHERE (`novels`.`id` = 1)
UPDATE `novels` SET `updated_at` = '2010-05-11 16:59:17', `click_count` = 1 WHERE `id` = 1

   def download
     @novel=Novel.find(params[:id])
---
SELECT * FROM `novels` WHERE (`novels`.`id` = 7)

   def search
     @novels=[]
      if params[:condition]!="tag"
     @novels=Novel.all(:conditions=>"#{params[:condition]} like '%#{params[:key]}%'")
      else
        @tags=Tag.all(:conditions=>"name like '%#{params[:key]}%'")
---
SELECT * FROM `novels` WHERE (writer like '%es%')
SELECT * FROM `tags` WHERE (name like '%1%')

   def collect
      @account=current_account
      @novels=@account.novels
      novel=Novel.find(params[:id])

      if !@account.nil?
        if(!@novels.include?(novel))
---
SELECT * FROM `novels` WHERE (`novels`.`id` = 1)
SELECT * FROM `novels` INNER JOIN `accounts_novels` ON `novels`.id = `accounts_novels`.novel_id WHERE (`accounts_novels`.account_id = 2 )

   def cancel_collected
     @account=current_account
     if !@account.nil?
       @account.novels.delete(Novel.find(params[:id]))
---
SELECT * FROM `novels` INNER JOIN `accounts_novels` ON `novels`.id = `accounts_novels`.novel_id WHERE (`accounts_novels`.account_id = 2 )