app/controllers/welcome_controller.rb

SELECT * FROM `categories`
---
  def index
    @categories=Category.all